tutorials/squarejet/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

epsilonInlet      1;

internalField   uniform $epsilonInlet;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.025;
        value           uniform $epsilonInlet;
    }
    coinlet
    {
//	type            zeroGradient;
        type            epsilonWallFunction;
        value     uniform $epsilonInlet;
    }
    outlet
    {
        type            zeroGradient;
    }
    empty
    {
        type            empty;
    }
    top
    {   
        type            zeroGradient;
    } 
    bottom
    {   
        type            epsilonWallFunction;
        value     uniform $epsilonInlet;
    } 
    nozzleWalls
    {   
//        type            zeroGradient;
        type            epsilonWallFunction;
        value     uniform $epsilonInlet;
    } 


}


// ************************************************************************* //
