tutorials/squarejet/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

kInlet          1e-1;

internalField   uniform $kInlet;

boundaryField
{

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;
        value           uniform 0.1;
    }
    coinlet
    {
	type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    empty
    {
        type            empty;
    }
    top
    {   
        type            zeroGradient;
    } 
    bottom
    {   
        type            zeroGradient;
    } 
    nozzleWalls
    {   
        type            zeroGradient;
    } 

}


// ************************************************************************* //
