tutorials/squarejet/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    Inlet1
    {
        type            calculated;
        value           uniform 0;
    }


    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    coinlet
    {
//        type            calculated;
//        value           uniform 0;
        type            nutkWallFunction;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    empty
    {
        type            empty;
    }
    top
    {   
        type            calculated;
        value           uniform 0;
    } 
    bottom
    {   
        type            nutkRoughWallFunction;
        Ks              uniform 0.0015;
        Cs              uniform 0.5;
        value           uniform 0;
    } 
    nozzleWalls
    {   
        type            nutkWallFunction;
        value           uniform 0;
    } 
}


// ************************************************************************* //
