tutorials/squarejet/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
//    grad(U)         cellLimited Gauss linear 1;
//    grad(p)         cellLimited Gauss linear 1;
//    grad(cellDisplacement)       Gauss linear;
}


divSchemes
{
    default         none;
    div(phi,U)      Gauss linearUpwind grad(U);//GammaV 1;//LUST grad(U);
    div(phi,k)      bounded Gauss limitedLinear 1;
    div(phi,omega)  Gauss Minmod;
    div(phi,epsilon)  bounded Gauss limitedLinear 1;
    div(phi,s)      bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,nuTilda)      Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
